Autodesk.Revit.DB.RoutingPreferenceRule.RemoveCriteron(System.Int32)
Removes an existing criterion.
index:
The index position of removed routing preference rule in the group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index.
-or-
Thrown if the index is out of bounds.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.AddCriterion(Autodesk.Revit.DB.RoutingCriterionBase)
Adds a new routing criterion.
myCriterion:
The criterion to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.GetCriterion(System.Int32)
Gets the specified criteria.
Returns:
The criterion at the specified zero-based index position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index.
-or-
Thrown if the index is out of bounds.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RoutingPreferenceRule.RoutingPreferenceManager
Gets the routing preference manager that owns this rule.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.NumberOfCriteria
Gets the number of routing criteria.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.MEPPartId
The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.Description
The description of the routing preference rule.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule.#ctor(Autodesk.Revit.DB.ElementId,System.String)
Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
MEPPartId:
The Id of the segment or fitting.  InvalidElementId may be specified if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
description:
The description of the rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceRule
A class representing a rule set in MEP routing preferences.
Since:
2013